In [10]:
import pandas as pd
import sqlite3

# Read sqlite query results into a pandas DataFrame
con = sqlite3.connect("tq.db")
df = pd.read_sql_query("SELECT * from User", con)

con.close()

In [9]:
df.head()

,id,role,name,email,password,registered_on,admin
0,1,Scientist,fakie scientist,science@hello.com,b'$2b$13$klvrKw.oZ/z0M132wf3IGea6tYxWvmClzraJJ...,2022-01-14 12:03:08.009693,0

In [11]:
con = sqlite3.connect("tq.db")

classrooms = pd.read_sql_query("SELECT * from ClassRoom", con)
con.close()
classrooms.head()

,id,user_id,name,semester,description,registered_on
0,1,1,first classroom,Spring 2022,this the first one yayy,2022-01-14 12:07:28.041701
1,2,4,Nicks C1,Spring 2021,oh yeah,2022-01-14 12:27:00.000000
2,3,4,Nick's Jawn,Spring 2022,yeeet,2022-01-14 12:27:00.000000